var homoglyphs = {
    "a": ["å", "α", "а", "ａ", "𝐚", "𝑎", "𝒂", "𝒶", "𝓪", "𝔞", "𝕒", "𝖆", "𝖺", "𝗮", "𝘢", "𝙖", "𝚊", "𝛂", "𝛼", "𝜶", "𝝰", "𝞪"],
    "b": ["β", "Ъ", "Ь", "ь", "ߕ", "ხ", "Ꮟ", "ᑲ", "ᕊ", "ᖯ", "♭", "𐌁", "𐌜", "𝐛", "𝑏", "𝒃", "𝒷", "𝔟", "𝕓", "𝖇", "𝖻", "𝗯", "𝘣", "𝙗", "𝚋"],
    "c": ["©", "ç", "С", "с", "ᑕ", "ꮯ", "ｃ", "𐐽", "𝐜", "𝑐", "𝒄", "𝒸", "𝓬", "𝔠", "𝕔", "𝖈", "𝖢", "𝖼", "𝗰", "𝘤", "𝙘", "𝚌"],
    "d": ["ð", "đ", "ժ", "߄", "ძ", "Ꮷ", "ᑯ", "ᑰ", "ᕍ", "∂̵", "ꓒ", "𝐝", "𝑑", "𝒅", "𝒹", "𝓭", "𝔡", "𝕕", "𝖉", "𝖽", "𝗱", "𝘥", "𝙙", "𝚍"],
    "e": ["Є", "е", "ҽ", "ᘓ", "€", "℮", "ｅ", "𐌴", "𝐞", "𝑒", "𝒆", "𝓮", "𝔢", "𝕖", "𝖊", "𝖾", "𝗲", "𝘦", "𝙚", "𝚎"],
    "f": ["ſ", "ƒ", "ғ", "բ", "ߓ", "Ｆ", "ｆ", "𐌅", "𝐟", "𝑓", "𝒇", "𝔣", "𝕗", "𝖋", "𝖿", "𝗳", "𝘧", "𝙛", "𝚏", "𝟋"],
    "g": ["ց", "ٶ", "Ⴚ", "Ꮐ", "Ｇ", "ｇ", "𝐠", "𝑔", "𝒈", "𝓰", "𝔤", "𝕘", "𝖌", "𝗀", "𝗴", "𝘨", "𝙜", "𝚐", "𝟿", "9"],
    "h": ["Ħ", "ħ", "Η", "Н", "һ", "ի", "հ", "Ⴙ", "ከ", "ዣ", "Ꮋ", "Ꮒ", "Ｈ", "ｈ", "𝐡", "𝒉", "𝒽", "𝓱", "𝔥", "𝕙", "𝖍", "𝗁", "𝗵", "𝘩", "𝙝", "𝚑"],
    "i": ["¡", "¦", "ı", "Ι", "ι", "І", "і", "أ", "ا", "Ꭵ", "ᛁ", "ꜟ", "ꭵ", "Ｉ", "ｉ", "𐒃", "𝐢", "𝑖", "𝒊", "𝒾", "𝓲", "𝔦", "𝔧", "𝕚", "𝖎", "𝗂", "𝗶", "𝘪", "𝙞", "𝚒", "𝚤", "𝛊", "𝜄", "𝜾", "𝝸", "𝞲"],
    "j": ["Ј", "ј", "յ", "ل", "ݪ", "Ꭻ", "ᒍ", "ᒎ", "ᒙ", "ᒨ", "Ｊ", "ｊ", "𝔧"],
    "k": ["ĸ", "Κ", "κ", "К", "қ", "Ꮶ", "ᛕ", "Ｋ", "ｋ", "𝐤", "𝑘", "𝒌", "𝓀", "𝓴", "𝕜", "𝗄", "𝗸", "𝘬", "𝙠", "𝚔"],
    "l": ["Ŀ", "Ł", "ł", "ι", "׀", "ו", "ן", "ا", "١", "۱", "ߊ", "Ꮮ", "ᛁ", "ℓ", "ⵏ", "ꓲ", "Ｌ", "ｌ", "￨", "𐌉", "𐌠", "𝐈", "𝐥", "𝐼", "𝑙", "𝑰", "𝒍", "𝓁", "𝔩", "𝖑", "𝖨", "𝗅", "𝗜", "𝗹", "𝘐", "𝘭", "𝙄", "𝙡", "𝙸", "𝚕", "𝚰", "𝛪", "𝜤", "𝝞", "𝞘", "𝟷", "1", "|"],
    "m": ["Μ", "М", "м", "ጣ", "Ꮇ", "ᘻ", "ᙏ", "ᛖ", "₥", "Ｍ", "ｍ", "𐌑", "𝑚", "𝓂", "𝓶", "𝔪", "𝕞", "𝖬", "𝗆", "𝗺", "𝙢", "𝚖"],
    "n": ["Ν", "η", "п", "ո", "ռ", "ᑎ", "Ｎ", "ｎ", "𝐧", "𝑛", "𝒏", "𝓃", "𝓷", "𝔫", "𝕟", "𝖓", "𝗇", "𝗻", "𝘯", "𝙣", "𝚗"],
    "o": ["°", "ø", "ο", "σ", "о", "օ", "ס", "٥", "ߋ", "०", "৹", "੦", "૦", "௦", "౦", "೦", "ഠ", "൦", "๐", "໐", "ဝ", "၀", "ჿ", "‎‎ơ", "₀", "◦", "ｏ", "𐐬", "𝐨", "𝑜", "𝒐", "𝓸", "𝔬", "𝕠", "𝖔", "𝗈", "𝗼", "𝘰", "𝙤", "𝚘", "𝛐", "𝛔", "𝜊", "𝜎", "𝝄", "𝝈", "𝝾", "𝞂", "𝞸", "𝞼", "0"],
    "p": ["Þ", "þ", "Ρ", "ρ", "Р", "р", "Ꮲ", "ᑭ", "ᕈ", "Ｐ", "ｐ", "𐌓", "𝐩", "𝑝", "𝒑", "𝓅", "𝓹", "𝔭", "𝕡", "𝖕", "𝗉", "𝗽", "𝘱", "𝙥", "𝚙", "𝛒", "𝛠", "𝜌", "𝝆", "𝞀", "𝞺"],
    "q": ["ԛ", "գ", "զ", "Ⴍ", "Ⴓ", "ჹ", "Ｑ", "ｑ", "𝐪", "𝑞", "𝒒", "𝓆", "𝓺", "𝔮", "𝕢", "𝖖", "𝗊", "𝗾", "𝘲", "𝙦", "𝚚"],
    "r": ["ſ", "г", "Ի", "Ꮢ", "ᚱ", "ꮁ", "ｒ", "𝐫", "𝑟", "𝒓", "𝓇", "𝓻", "𝔯", "𝕣", "𝖗", "𝗋", "𝗿", "𝘳", "𝙧", "𝚛"],
    "s": ["ѕ", "Տ", "Ⴝ", "Ꭶ", "Ꮪ", "ꕶ", "ꮪ", "ｓ", "𐑈", "𝐬", "𝑠", "𝒔", "𝓈", "𝓼", "𝔰", "𝕤", "𝖘", "𝗌", "𝘀", "𝘚", "𝘴", "𝙨", "𝚜"],
    "t": ["ţ", "ŧ", "Τ", "τ", "Т", "ߙ", "Ꭲ", "†", "✝", "Ｔ", "ｔ", "𝐭", "𝑡", "𝒕", "𝓉", "𝓽", "𝔱", "𝕥", "𝖙", "𝗍", "𝘁", "𝘵", "𝙩", "𝚝", "+", "t̵"],
    "u": ["µ", "μ", "υ", "Ա", "Մ", "Ս", "ս", "ߎ", "ປ", "ᑌ", "ᙀ", "∪", "ⵡ", "Ｕ", "ｕ", "𝐮", "𝑢", "𝒖", "𝓊", "𝓾", "𝔲", "𝕦", "𝖚", "𝗎", "𝘂", "𝘶", "𝙪", "𝚞", "𝛖", "𝜐", "𝝊", "𝞄", "𝞾"],
    "v": ["˅", "ν", "Ꮩ", "ᐯ", "∨", "ⴸ", "ꮩ", "Ｖ", "ｖ", "𝐯", "𝑣", "𝒗", "𝓋", "𝓿", "𝕧", "𝗏", "𝘃", "𝘷", "𝙫", "𝚟", "𝛎", "𝜈", "𝝂", "𝝼", "𝞶"],
    "w": ["Ԝ", "ԝ", "ա", "Ꮃ", "ꮃ", "Ｗ", "ｗ", "𝐰", "𝑤", "𝒘", "𝓌", "𝔀", "𝔴", "𝕨", "𝖜", "𝗐", "𝘄", "𝘸", "𝙬", "𝚠", "🝃"],
    "x": ["×", "Χ", "χ", "Х", "ж", "х", "ᕁ", "᙭", "᙮", "ⵋ", "ⵝ", "Ｘ", "ｘ", "𝐱", "𝑥", "𝒙", "𝓍", "𝔁", "𝔵", "𝕩", "𝖝", "𝗑", "𝘅", "𝘹", "𝙭", "𝚡"],
    "y": ["Υ", "γ", "у", "Ү", "ү", "Ұ", "ݍ", "Ⴘ", "ყ", "Ꭹ", "Ｙ", "ｙ", "𝐲", "𝑦", "𝒚", "𝓎", "𝔂", "𝕪", "𝗒", "𝘆", "𝘺", "𝙮", "𝚢", "𝛄", "𝛾", "𝜸", "𝝲", "𝞬"],
    "z": ["Ζ", "Ꮓ", "☡", "ꮓ", "Ｚ", "ｚ", "𝐳", "𝑧", "𝒛", "𝓏", "𝔃", "𝕫", "𝗓", "𝘇", "𝘻", "𝙯", "𝚣", "𝛧", "𝜁"]
};

function pick(array) {
    return array[Math.floor(Math.random(0, 1) * array.length)];
}

function spoof(text) {
    var spoofed = "", i, homoglyph_array;
    for (i = 0; i < text.length; i++) {
        homoglyph_array = homoglyphs[text[i].toLowerCase()];
        if (homoglyph_array == undefined) {
            spoofed += text[i];
        }
        else {
            spoofed += pick(homoglyphs[text[i].toLowerCase()]);
        }
    }
    return spoofed;
}

function show_spoof() {
    var text = document.getElementById("input").value;
    var spoofed = spoof(text);
    document.getElementById("output").value = spoofed;
}

function init() {
    var input = document.getElementById("input");
    input.value = "Fakey Fakeson‏ @admittedlyhuman 12 Jul 2015\r\ntwitter is basically a teleportation device. you read my tweets and become more similar to me, while on the other end I grow closer to death";
    show_spoof();

    input.addEventListener("input", show_spoof);
}

window.onload = init;