var homoglyphs = {
    "A" : ["Α", "А", "Ꭺ", "ᗅ", "ᴀ", "ꓮ", "Ά"],
    "B" : ["ʙ", "Β", "В", "в", "Ᏼ", "ᗷ", "ᛒ", "𐌁", "ꓐ", "Ꞵ", "β"],
    "C" : ["Ϲ", "С", "Ꮯ", "Ⲥ", "ꓚ"],
    "D" : ["Ꭰ", "ᗞ", "ᗪ", "ꓓ"],
    "E" : ["Ε", "Е", "Ꭼ", "⋿", "ⴹ", "ꓰ", "Ё", "Є"],
    "F" : ["Ϝ", "ᖴ", "ꓝ", "Ꞙ", "Ғ", "ғ"],
    "G" : ["ɢ", "Ԍ", "ԍ", "Ꮐ", "Ᏻ", "ꓖ", "Ⴚ"],
    "H" : ["ʜ", "Η", "Н", "н", "Ꮋ", "ᕼ", "Ⲏ", "ꓧ", "Ң", "Ԩ", "ዣ"],
    "I" : ["І", "Ї", "Ϊ", "Ι"],
    "J" : ["Ϳ", "Ј", "Ꭻ", "ᒍ", "ꓙ", "Ʝ", "ل", "ݪ"],
    "K" : ["Κ", "К", "Ꮶ", "ĸ", "κ", "қ", "ᛕ", "Ⲕ", "ꓗ"],
    "L" : ["ʟ", "Ꮮ", "ᒪ", "Ⳑ", "ⳑ", "ꓡ", "Լ", "ւ", "լ"],
    "M" : ["Μ", "Ϻ", "М", "Ꮇ", "ᗰ", "ᛖ", "𐌑", "Ⲙ", "ꓟ", "м", "ᘻ", "ᙏ"],
    "N" : ["ɴ", "Ν", "Ⲛ", "ꓠ", "Ŋ"],
    "O" : ["Ό", "О", "Ο", "Օ", "Θ", "0"],
    "P" : ["Ρ", "Р", "Ꮲ", "ᑭ", "Ⲣ", "ꓑ", "ᕈ", "𐌓"],
    "Q" : ["ⵕ", "Ԛ", "Ⴍ", "Ⴓ"],
    "R" : ["Ʀ", "ʀ", "Ꭱ", "Ꮢ", "ᖇ", "ᚱ", "ꓣ"],
    "S" : ["Ѕ", "Տ", "Ꮥ", "Ꮪ", "ꓢ", "Ⴝ", "Ꭶ", "ꕶ"],
    "T" : ["Τ", "Т", "Ꭲ", "⊤", "⟙", "Ⲧ", "ꓔ", "Ҭ", "τ", "τ", "т"],
    "U" : ["Ս", "ᑌ", "∪", "⋃", "ꓴ", "Մ", "Ա", "ᙀ"],
    "V" : ["Ѵ", "٧", "۷", "Ꮩ", "ᐯ", "ⴸ", "ꓦ"],
    "W" : ["Ԝ", "Ꮃ", "Ꮤ", "ꓪ"],
    "X" : ["Χ", "Х", "᙭", "χ", "ᚷ", "╳", "Ⲭ", "х", "ⵝ", "ꓫ", "ж", "Ꭓ"],
    "Y" : ["Υ", "ϒ", "Ү", "Ꭹ", "Ꮍ", "Ⲩ", "ꓬ", "Ϋ", "Ұ"],
    "Z" : ["Ζ", "Ꮓ", "ꓜ"],
    "a" : ["α", "а", "ά", "𝜶", "𝝰", "𝞪", "𝛂", "𝛼"],
    "b" : ["Ƅ", "Ь", "ь", "Ꮟ", "ᖯ", "𐌜", "♭", "ᕊ", "ᑲ", "ხ", "ߕ", "Ъ"],
    "c" : ["с", "ꮯ", "𐐽"],
    "d" : ["ԁ", "Ꮷ", "ᑯ", "ꓒ", "ժ", "߄", "ძ", "ᑰ", "ᕍ", "∂̵"],
    "e" : ["е", "ҽ", "℮", "ё", "𐌴", "ᘓ"],
    "f" : ["ẝ", "ꞙ", "ꬵ", "բ", "𝟋", "𐌅", "ߓ", "ƒ"],
    "g" : ["ƍ", "ɡ", "ց", "ᶃ"],
    "h" : ["һ", "հ", "Ꮒ", "ћ", "♄", "Ⴙ", "ከ"],
    "i" : ["ı", "ɩ", "ɪ", "ι", "Ꭵ", "⍳", "ꙇ", "¡", "ı", "ΐ", "ϊ", "і", "ї", "ا", "𝔧", "ꭵ", "𝚤", "𝛊", "𝜄", "𝜾", "𝝸", "ᛁ", "ⵏ", "ꓲ", "𐌉", "𐌠", "𝚰", "𝛪", "𝜤", "𝝞", "𝞘", "ı", "ι", "׀", "ו"],
    "j" : ["ј", "յ", "ᒎ", "ᒙ"],
    "k" : ["ĸ", "κ", "к"],
    "l" : ["ӏ", "￨"],
    "m" : ["⩋", "ო", "ᙏ", "ጠ", "₥", "ෆ", "ᘻ", "ɱ"],
    "n" : ["π", "п", "ո", "ռ", "ᴨ", "ŋ", "η", "ղ", "ή", "ր"],
    "o" : ["ο", "σ", "о", "օ", "०", "੦", "૦", "৹", "௦", "౦", "೦", "൦", "๐", "໐", "ჿ", "ᴏ", "ᴑ", "ⲟ", "ꬽ", "ό", "ഠ", "₀", "𐐬", "𝛐", "𝜊", "𝝄", "𝝾", "𝞸"],
    "p" : ["ρ", "р", "𝛒", "𝜌", "𝝆", "𝞀", "𝞺"],
    "q" : ["ԛ", "գ", "զ", "ჹ"],
    "r" : ["г", "ѓ", "Ի", "ꮁ"],
    "s" : ["ѕ", "ꮪ", "𐑈"],
    "t" : ["†", "✝", "ߙ"],
    "u" : ["υ", "ц", "ս", "ᴜ", "ꭎ", "ꭒ", "ϋ", "ύ", "ߎ", "ປ", "∪", "ⵡ"],
    "v" : ["ν", "ѵ", "ᴠ", "∨", "⋁", "˅", "ⴸ", "ꮩ", "𝛎", "𝜈", "𝝂", "𝝼", "𝞶"],
    "w" : ["ԝ", "ա", "ꮃ", "🝃"],
    "x" : ["×", "х", "ᕁ", "ᕽ", "᙮", "⤫", "⤬", "⨯", "×", "ᕁ", "᙮", "ⵋ", "ⵝ"],
    "y" : ["ɣ", "ʏ", "γ", "у", "ү", "ყ", "ᶌ", "ỿ", "ℽ", "ꭚ", "ў", "Ⴘ", "Ꭹ", "𝛄", "𝛾", "𝜸", "𝝲", "𝞬"],
    "z" : ["☡", "ꮓ", "𝛧", "𝜁"]
};

function pick(array) {
    return array[Math.floor(Math.random(0, 1) * array.length)];
}

function spoof(text) {
    var spoofed = "", i, homoglyph_array;
    for (i = 0; i < text.length; i++) {
        homoglyph_array = homoglyphs[text[i]];
        if (homoglyph_array == undefined) {
            spoofed += text[i];
        }
        else {
            spoofed += pick(homoglyphs[text[i]]);
        }
    }
    return spoofed;
}

function show_spoof() {
    var text = document.getElementById("input").value;
    var spoofed = spoof(text);
    document.getElementById("output").value = spoofed;
}

function init() {
    var input = document.getElementById("input");
    input.value = "ABCDEFGHIJKLMNOPQRSTUVWXYZ\r\nabcdefghijklmnopqrstuvwxyz";
    show_spoof();

    input.addEventListener("input", show_spoof);
}

window.onload = init;
